In [ ]:
import pandas as pd

In [6]:
df = pd.DataFrame({
    'name': ['Robert', 'Felicia', 'Diana', 'Jim', 'Julia', 'Nathan'],
    'age': [22, 34, 27, 45, 36, 21],
    'occupation': ['Designer', 'Programmer', 'Data Scientist', 'Unemployed', 'Unemployed', 'Manager']
})

df = df.set_index('name')

In [7]:
import datetime as dt

df['birthday'] = df['age'].apply(lambda x: dt.datetime.now() - dt.timedelta(days=365*x))

In [ ]:
df.groupby('occupation').agg({ # by using this function,  
    'age': 'mean'              # you can group data by aggregating different types of data into new columns
})

                 age
occupation
Data Scientist  27.0
Designer        22.0
Manager         21.0
Programmer      34.0
Unemployed      40.5

In [17]:
df.groupby('occupation').agg({
    'age': ['mean', 'median', 'min', 'max', 'std']
})

                 age
                mean median min max       std
occupation
Data Scientist  27.0   27.0  27  27       NaN
Designer        22.0   22.0  22  22       NaN
Manager         21.0   21.0  21  21       NaN
Programmer      34.0   34.0  34  34       NaN
Unemployed      40.5   40.5  36  45  6.363961